app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" DEFAULT VALUES
---
    def create
        @schoolclass = SchoolClass.new
        @schoolclass.title = params[:school_class][:title]
        @schoolclass.room_number = params[:school_class][:room_number]
        @schoolclass.save